cf_billing/Documents/энргОбходнойЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргОбходнойЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргЗарегистрированныйОбъемПриборов</xr:Item>
				<xr:Item>InformationRegister.энргПоказанияПриборовУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПоказаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоказаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>URLДляЧтения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргЗагрузкаПоказанийИзВнешнихИсточников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказанияПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеЗначениеТарифа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказанияПредоставлены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючПомещения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПримечаниеДляТУ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАдресАбонента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШкалыПриборовУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Catalogs/энргКлючиПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргКлючиПомещений</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Строение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧастныйСектор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Documents/энргОбходнойЛист/Forms/ФормаДокументаМассовыйВвод/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	энргЛокализацияСервер.ПриСозданииНаСервере_энргОбходнойЛист(ЭтотОбъект);
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
			ОбновитьПериодНачисления();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
		яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
		энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета);
		
		ПоказанияПредоставляютсяВСрок();
		ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	КонецЕсли;
	
	// ВводНаОсновании
	ВводНаОсновании.ПриСозданииНаСервере(ЭтотОбъект, Элементы.ПодменюСоздатьНаОсновании);
	// Конец ВводНаОсновании

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ПодменюОтчеты;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	яИспользоватьТарифныеЗоны 		= Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьТарифныеЗоны");
	яИспользоватьШкалыПриборовУчета = Обработки.энргКонстантыМенеджер.ЗначениеФункциональнойОпции("энргИспользоватьШкалыПриборовУчета");
	энргШкалыТарифныеЗоныСервер.ПриСозданииЧтенииНаСервере(ЭтотОбъект,яИспользоватьТарифныеЗоны,яИспользоватьШкалыПриборовУчета,ТекущийОбъект);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	энргРаботаСприборамиУчетаСервер.ЗаполнитьСвойствоРегистрируетОбъемПриЧтении(Объект.ТочкиУчета,ТекущийОбъект);
	
	ПоказанияПредоставляютсяВСрок();
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	энргШкалыТарифныеЗоныСервер.ЗаполнитьОбъектПоПредставлениюФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
			
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, ТекущийОбъект, ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	ОбновитьПериодНачисления();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда		
		ОбновитьПериодНачисления();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СтроениеПриИзмененииНаСервере()
	Объект.Маршрут 		= Объект.Строение.МаршрутКонтроллера;
	Объект.Контроллер 	= Объект.Маршрут.Владелец; 
КонецПроцедуры

&НаКлиенте
Процедура СтроениеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыПолученияДанных.СпособПоискаСтроки = СпособПоискаСтрокиПриВводеПоСтроке.ЛюбаяЧасть; 
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТочкиУчета

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыШкал							= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыШкал	 					= Элементы[ИмяТаблицыШкал];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидКанальностиПриАктивацииСтроки(ТаблицаФормыШкал,"IDСтрокиТочкиУчета",ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаЕстьШкалыНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчетаЕстьШкалыНетТарифныхЗон";
	ИмяТаблицыПоказания						= "ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки,Неопределено,"ТочкиУчета"); 
	// энргРаботаСВидомДифференцированности }
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте

Процедура ТочкиУчетаНетШкалЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчета" + ПрефиксТочекУчета;
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанные.IDСтроки) Тогда
		ТекущиеДанные.IDСтроки 				= Новый УникальныйИдентификатор;
	КонецЕсли;
	
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтрокиШкалы); 
	// энргРаботаСВидомДифференцированности }

	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
	
	//Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");		
	//ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
	//ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
	//Иначе	
	//	ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
	//КонецЕсли;
	
	//Если Объект.ТочкиУчета.Количество() > 0 Тогда
	//	ТаблицаФормыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - 1].ПолучитьИдентификатор();
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонПриАктивизацииСтроки(Элемент)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	энргРаботаСПриборамиУчетаКлиент.РаботаСВидимостьюИДоступностьюСтрокПУ(ТекущиеДанные.РегистрируетОбъем,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПередУдалением(Элемент, Отказ)
	ИмяТаблицыТочек 						= "ТочкиУчета" + ПрефиксТочекУчета;
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;
	
	ТаблицыФормы				= Новый Массив;	
	ТаблицыФормы.Добавить("ШкалыПриборовУчета");
	
	ТаблицыФормыВторогоУровня	= Новый Массив;
	ТаблицыФормыВторогоУровня.Добавить("ПоказанияПриборовУчета");

	энргПользовательскийВводКлиент.УдалитьЗависимыеСтроки(ТекущиеДанные.IDСтроки, Объект, ТаблицыФормы, "ТочкиУчета", ТаблицыФормыВторогоУровня);
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаНетШкалНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоныПриАктивизацииСтроки(Элемент)
	ИмяТаблицыШкал	 						= "ШкалыПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ИмяТаблицыПоказания						= "ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны";
	ТаблицаФормыПоказания 					= Элементы[ИмяТаблицыПоказания];
	
	ТекущиеДанные 							= Элементы[ИмяТаблицыШкал].ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	// энргРаботаСВидомДифференцированности {
	энргРаботаСТочкамиУчетаКлиент.ВидДифференцированностиПриАктивацииСтроки(ТаблицаФормыПоказания,Неопределено,ТекущиеДанные.IDСтроки); 
	// энргРаботаСВидомДифференцированности }
КонецПроцедуры

&НаКлиенте
Процедура ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗонРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказанияПриборовУчета

&НаКлиенте
Процедура ПриборыУчетаТекущиеПоказанияПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	//энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные);
	
	КоличествоДобавленныхСтрок = ПолучитьКоличествоСтрок(ТекущиеДанные.IDСтроки);
	
	Если КоличествоДобавленныхСтрок = 1 Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	ИначеЕсли КоличествоДобавленныхСтрок = 2 и ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Ночь") Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	ИначеЕсли КоличествоДобавленныхСтрок = 3 и ТекущиеДанные.ТарифнаяЗона = ПредопределенноеЗначение("Справочник.энргТарифныеЗоны.Пик") Тогда
		ПереходНаНовуюСтрокуТочкиУчета = Истина;
	Иначе   ПереходНаНовуюСтрокуТочкиУчета = Ложь;
	КонецЕсли;
	
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	Если Объект.ПоказанияПриборовУчета.Количество() > ТекущиеДанные.НомерСтроки Тогда
		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[ТекущиеДанные.НомерСтроки].ПолучитьИдентификатор();
	КонецЕсли;
	
	
	Если ПереходНаНовуюСтрокуТочкиУчета И Объект.ТочкиУчета.Количество() > ТекущиеДанныеТочкиУчета.НомерСтроки Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[ТекущиеДанныеТочкиУчета.НомерСтроки].ПолучитьИдентификатор();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаПереворотПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("ПереворотИзмененПользователем",истина));	
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПриборыУчетаСостояниеПоказанийПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата,Новый Структура("СтатусИзмененПользователем",истина));
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныРазницаПриИзменении(Элемент)
	ТекущиеДанныеТочкиУчета  	= энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеТочкиУчета(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	Если ТекущиеДанныеТочкиУчета = Неопределено Тогда
		  Возврат;
	КонецЕсли;
	ТекущиеДанные = энргШкалыТарифныеЗоныКлиент.ТекущиеДанныеПоказаний(Элементы,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные,ТекущиеДанныеТочкиУчета.РегистрируетОбъем,Объект.Дата);
	//ТекущиеДанные.ПоказанияПредоставлены = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область КомандыФормы

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	СтроениеПриИзмененииНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказания(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Строение) Тогда
		ПоказатьПредупреждение(,"Заполните Строение");
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоОтборуЕсть("Строение", Объект.Строение) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По строению данные заполнены.");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеДляЗаполненияПоСтроению(); 
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполненияПоСтроению()
	// выводим данные по подключенным услугам и задолженности
	ОтборСтроение 	= Объект.Строение;//?(ЗначениеЗаполнено(Объект.Строение), Объект.Строение, Неопределено);
	Результат 		= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПоМаршруту(Объект.Дата, Объект.Организация, Объект.Район, Объект.Маршрут, Объект.Строение); 
	ЗаполнитьПоказанияНаСервере(Результат);	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоАбоненту(Команда)
	Если НЕ ЗначениеЗаполнено(Абонент) Тогда
		ПоказатьПредупреждение(,"Заполните Абонента");
		Возврат;
	КонецЕсли;
	
	Если ДанныеПоОтборуЕсть("Абонент", Абонент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("По абоненту: " + СокрЛП(Абонент) + " данные заполнены.");
		Возврат;
	КонецЕсли;
	
	ПолучитьДанныеДляЗаполненияПоАбоненту();	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеДляЗаполненияПоАбоненту()
	Результат = энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,Абонент.КлючПомещения); 	
	ЗаполнитьПоказанияНаСервере(Результат);
КонецФункции

#КонецОбласти

// ВводНаОсновании
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуСоздатьНаОсновании(Команда)
	
	ВводНаОснованииКлиент.ВыполнитьПодключаемуюКомандуСоздатьНаОсновании(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры
// Конец ВводНаОсновании

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
	МодульПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
	МодульПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	МодульПодключаемыеКомандыКлиентСервер = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиентСервер");
	МодульПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужубныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПоказанияНаСервере(Результат)

	Выборка  									= Результат.выбрать();
	ТекКлючПомещения							= Неопределено;
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() Цикл 
		НоваяТочка = Ложь;
		Если Не ТекКлючПомещения = Выборка.КлючПомещения Или НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения 		= Выборка.КлючПомещения;
			СтрокаТочкиУчета.Абонент 			= Выборка.Абонент;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона; 
		
		ТекКлючПомещения 						= Выборка.КлючПомещения;
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
	    ТекШкала 								= Выборка.Шкала
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация, Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата,Истина);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
	
	энргРаботаСЛицевымСчетомСервер.ПриЧтенииНаСервереДанныеПомещенияКоллекция(Объект,"ТочкиУчета");
	
	Объект.ТочкиУчета.Сортировать("Строение,Помещение");
	
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАбонентаСервер(КлючПомещения)
	// добавить абонента
	Результат 									= энргСостояниеПриборовУчета.ДействующиеПриборыУчетаПомещения(Объект.Дата,Объект.Организация,Объект.Район,КлючПомещения); 
	Выборка  									= Результат.выбрать();
	ТекТочкаУчета 								= Неопределено;
	ТекШкала 									= Неопределено;
	IDСтрокиТочки 								= Неопределено;
	IDСтрокиШкалы 								= Неопределено;
	Пока Выборка.следующий() цикл
		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.КлючПомещения	 	= КлючПомещения;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;   						
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район,КлючПомещения); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект,Объект,ИспользоватьТарифныеЗоны,ИспользоватьШкалыПриборовУчета);
	
КонецПроцедуры

&НаСервере
Функция ДанныеПоОтборуЕсть(ИмяРеквизита, ЗначениеРеквизита)
	Возврат Объект.ТочкиУчета.НайтиСтроки(Новый Структура(ИмяРеквизита, ЗначениеРеквизита)).Количество() > 0;
КонецФункции

&НаСервере
Процедура ОбновитьПериодНачисления()
	
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация, Объект.Район);
	ПоказанияПредоставляютсяВСрок();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоСтрок(IDСтроки)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("IDСтроки", IDСтроки);
	НайденныеСтроки = Объект.ПоказанияПриборовУчета.НайтиСтроки(ПараметрыОтбора);
	
	Возврат НайденныеСтроки.Количество();
		
КонецФункции

#Область СервисПроверкиПоказанийПриборовУчета

&НаСервере
Процедура ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний()
	
	ТаблицаПриборов = энргРаботаСПоказаниямиПриборовУчетаСервер.НоваяТаблицаПриборовДляПроверки();
	Для Каждого ТекСтрока из Объект.ТочкиУчета Цикл
		НСтрока = ТаблицаПриборов.Добавить();
		ЗаполнитьЗначенияСвойств(НСтрока, ТекСтрока);
		НСтрока.Район = Объект.Район;
	КонецЦикла;
	
	ПериодЗапроса = Новый Граница(Объект.Дата, ВидГраницы.Исключая);
	ВспомогательныеПараметры = энргРаботаСПоказаниямиПриборовУчетаСервер.НовыеВспомогательныеПараметрыПроверкиОтклоненияПоказаний();
	ВспомогательныеПараметры.ПоказанияВСрок = ПоказанияВСрок;
	ВспомогательныеПараметры.ПериодНачисления = Объект.ПериодНачисления;
	
	РезультатЗапроса = энргРаботаСПоказаниямиПриборовУчетаСервер.ПриборыДляОтклоненияПоказаний(ПериодЗапроса, Объект.Организация, ТаблицаПриборов, ВспомогательныеПараметры);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний(ЭтотОбъект, РезультатЗапроса);
	
КонецПроцедуры

&НаСервере
Процедура ПоказанияПредоставляютсяВСрок()
	ПоказанияВСрок = энргРаботаСПоказаниямиПриборовУчетаСервер.ПоказанияПредоставляютсяВСрок(Объект.ПериодНачисления, Объект.Дата, Объект.Организация, Объект.Район);
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСтрокуСПоказаниями(ТекущиеДанныеТочкиУчета, ТекущиеДанные)
	РезультатПроверки = энргРаботаСПоказаниямиПриборовУчетаКлиент.ОпределитьСостояниеПоказанийПоСтроке(ТекущиеДанныеТочкиУчета.ПриборУчета, ЭтотОбъект, ТекущиеДанные);
	Если РезультатПроверки.СостояниеИзменено Тогда
		ЗаполнитьЗначенияСвойств(ТекущиеДанные, РезультатПроверки);
		Возврат;
	КонецЕсли;
	
	энргРаботаСПоказаниямиПриборовУчетаКлиент.ПересчитатьСтрокуПриборовУчета(ТекущиеДанные, ТекущиеДанныеТочкиУчета.РегистрируетОбъем, Объект.Дата); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДанныеАбонента(Команда)
	ОткрытьФормуПодбораАбонетов();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораАбонетов(ФИО = "", ИдТекСтроки = Неопределено)
	
	Перем ОписаниеОповещения, Период, ТекПараметры;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьДанныеАбонентаЗавершение",ЭтаФорма);

	ТекПараметры = Новый Структура("Организация, Район, Строение, Контроллер, Маршрут, Период", 
					Объект.Организация,Объект.Район,Объект.Строение, Объект.Контроллер, Объект.Маршрут, Объект.Дата);
 	Если ИдТекСтроки <> Неопределено Тогда 
		ТекПараметры.Вставить("ФИО", ФИО);
		ТекПараметры.Вставить("ИдТекСтроки", ИдТекСтроки);
	КонецЕсли;
	ОткрытьФорму("Документ.энргОбходнойЛист.Форма.ФормаПоискаЛС",ТекПараметры, ЭтаФорма,,,, ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСтроению(Команда)
	
	КоличествоСтрокПоказанияПУДо = Объект.ПоказанияПриборовУчета.Количество();
	
	КоличествоСтрокТочкиУчетаДо = Объект.ТочкиУчета.Количество();
	
	ЗаполнитьАбонентовПоСтроениюНаСервере();
	
	КоличествоСтрокПоказанияПУПосле = Объект.ПоказанияПриборовУчета.Количество();
	
	КоличествоСтрокТочкиУчетаПосле = Объект.ТочкиУчета.Количество();
	
	КоличествоДобавленныхСтрокПУ = КоличествоСтрокПоказанияПУПосле - КоличествоСтрокПоказанияПУДо;
	
	КОличествоДобавленныхСтрокТУ = КоличествоСтрокТочкиУчетаПосле - КоличествоСтрокТочкиУчетаДо;
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	Если Объект.ТочкиУчета.Количество() > 0 И КОличествоДобавленныхСтрокТУ > 0 Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[Объект.ТочкиУчета.Количество() - КОличествоДобавленныхСтрокТУ].ПолучитьИдентификатор();
	КонецЕсли;

	
	Если Объект.ПоказанияПриборовУчета.Количество() > 0 И КоличествоДобавленныхСтрокПУ > 0 Тогда
		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - КоличествоДобавленныхСтрокПУ].ПолучитьИдентификатор();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАбонентовПоСтроениюНаСервере()

	РезультатЗапроса = Обработки.энргСостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПоМаршруту(Объект.Дата, Объект.Организация, Объект.Район, Неопределено, Объект.Строение, Истина); 
	ЗаполнитьПоказанияНаСервере(РезультатЗапроса);

КонецПроцедуры

#КонецОбласти

#Область СервисРаботыСМассовымВводом

&НаКлиенте
Процедура ДобавитьДанныеАбонентаЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТипЗнч(Результат) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Результат.Свойство("Абонент") Или НЕ Результат.Свойство("КлючПомещения") Тогда
		Возврат;
	КонецЕсли;
	
	
	// ищем строки по ключу помещения
	мСтроки  = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("КлючПомещения",Результат.КлючПомещения));
	Если НЕ мСтроки.Количество()  = 0 Тогда
		Ответ = Неопределено;
		
		ПоказатьВопрос(Новый ОписаниеОповещения("АнализОтветаНаДублированиеПоказаний", ЭтотОбъект, Новый Структура("мСтроки, Результат", мСтроки, Результат)), "По данному абоненту уже введены показания. Ввести ещё?", РежимДиалогаВопрос.ДаНет);
		
		Возврат;
		
		
	Иначе
		КлючРодителя = ПолучитьКлючПомещенияРодителя(Результат.КлючПомещения);
		Если ЗначениеЗаполнено(КлючРодителя) Тогда
			мСтроки  = Объект.ТочкиУчета.НайтиСтроки(Новый Структура("КлючПомещения",КлючРодителя));
			Если НЕ мСтроки.Количество()  = 0 Тогда
				Ответ = Неопределено;
				
				ПоказатьВопрос(Новый ОписаниеОповещения("АнализОтветаНаДублированиеПоказаний", ЭтотОбъект, Новый Структура("мСтроки, Результат", мСтроки, Результат)), "По данному абоненту уже введены показания. Ввести ещё?", РежимДиалогаВопрос.ДаНет);
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
	ДобавитьПУ_Абонента(Результат);
КонецПроцедуры

&НаКлиенте
Процедура АнализОтветаНаДублированиеПоказаний(РезультатВопроса, ДополнительныеПараметры1) Экспорт
	
	мСтроки = ДополнительныеПараметры1.мСтроки;
	Результат = ДополнительныеПараметры1.Результат;
	
	
	Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.Нет Тогда 
		Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");		
		ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		Иначе	
			ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		КонецЕсли;
		
		Если Объект.ТочкиУчета.Количество() > 0 Тогда
			ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - 1].ПолучитьИдентификатор();
		КонецЕсли;
		
	Иначе
		
			ДобавитьПУ_Абонента(Результат);

		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПУ_Абонента(Знач Результат)
	
	КоличествоСтрокПоказанияПУДо = Объект.ПоказанияПриборовУчета.Количество();
	
	ЗаполнитьДанныеПриборовУчета(Результат.Абонент, Результат.КлючПомещения);
	
	КоличествоСтрокПоказанияПУПосле = Объект.ПоказанияПриборовУчета.Количество();
	
	КОличествоДобавленныхСтрок = КоличествоСтрокПоказанияПУПосле - КоличествоСтрокПоказанияПУДо;
	
	Если ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыЕстьТарифныеЗоныТекущиеПоказания;
	ИначеЕсли НЕ ИспользоватьТарифныеЗоны И ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаЕстьШкалыНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ШкалыПриборовУчетаЕстьШкалыНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаЕстьШкалыНетТарифныхЗонТекущиеПоказания;
	ИначеЕсли ИспользоватьТарифныеЗоны И НЕ ИспользоватьШкалыПриборовУчета Тогда
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалЕстьТарифныеЗоны");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоны");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалЕстьТарифныеЗоныТекущиеПоказания;
	Иначе	
		ИмяТаблицыТочкиУчета = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ИмяТаблицыПоказания = ЭтаФорма.Элементы.Найти("ТочкиУчетаНетШкалНетТарифныхЗон");
		ТекущийЭлемент = Элементы.ПоказанияПриборовУчетаНетШкалНетТарифныхЗонТекущиеПоказания;
	КонецЕсли;
	
	
	Если Объект.ТочкиУчета.Количество() > 0 И КОличествоДобавленныхСтрок > 0 Тогда
		ИмяТаблицыТочкиУчета.ТекущаяСтрока = Объект.ТочкиУчета[Объект.ТочкиУчета.Количество() - 1].ПолучитьИдентификатор();

		ИмяТаблицыПоказания.ТекущаяСтрока = Объект.ПоказанияПриборовУчета[Объект.ПоказанияПриборовУчета.Количество() - КОличествоДобавленныхСтрок].ПолучитьИдентификатор();
	КонецЕсли;
	ЗаполнитьТаблицуПриборыДляОтклоненияПоказаний();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПриборовУчета(Абонент,КлючПомещения) 
	
	Результат 		= Обработки.энргСостояниеПриборовУчетаМенеджер.ДействующиеПриборыУчетаПомещения(Объект.Дата, Объект.Организация, Объект.Район, КлючПомещения, Неопределено, Истина, Новый Структура("ТолькоОткрытыеЛС", Истина)); 
	Выборка  		= Результат.выбрать();
	ТекТочкаУчета 	= Неопределено;
	ТекШкала 		= Неопределено;
	IDСтрокиТочки 	= Неопределено;
	IDСтрокиШкалы 	= Неопределено;
	Пока Выборка.Следующий() цикл

		НоваяТочка = Ложь;
		Если НЕ ТекТочкаУчета = Выборка.ТочкаУчета Тогда
			НоваяТочка = Истина;
			СтрокаТочкиУчета  					= Объект.ТочкиУчета.Добавить();
			IDСтрокиТочки 						= Новый УникальныйИдентификатор;
			СтрокаТочкиУчета.IDСтроки 			= IDСтрокиТочки;
			СтрокаТочкиУчета.Абонент 			= Абонент;
			СтрокаТочкиУчета.КлючПомещения 		= КлючПомещения;
			СтрокаТочкиУчета.ТочкаУчета 		= Выборка.ТочкаУчета;
			СтрокаТочкиУчета.Услуга 			= Выборка.Услуга;
			СтрокаТочкиУчета.ПриборУчета 		= Выборка.ПриборУчета;
			СтрокаТочкиУчета.РегистрируетОбъем 	= Выборка.РегистрируетОбъем;
			
			энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(Выборка.Абонент,СтрокаТочкиУчета);

		КонецЕсли;
		
		Если НоваяТочка Или НЕ ТекШкала = Выборка.Шкала Тогда
			СтрокаШкалы  						= Объект.ШкалыПриборовУчета.Добавить();
			IDСтрокиШкалы 						= Новый УникальныйИдентификатор;
			СтрокаШкалы.IDСтрокиТочкиУчета 		= IDСтрокиТочки;
			СтрокаШкалы.IDСтроки 				= IDСтрокиШкалы;
			СтрокаШкалы.Шкала 					= Выборка.Шкала;
			СтрокаШкалы.ВидДифференцированности = Выборка.ВидДифференцированности;
		КонецЕсли;

		СтрокаПоказаний 						= Объект.ПоказанияПриборовУчета.Добавить();
		СтрокаПоказаний.IDСтроки 				= IDСтрокиШкалы;
		СтрокаПоказаний.ТарифнаяЗона 			= Выборка.ТарифнаяЗона;
		
		ТекТочкаУчета 							= Выборка.ТочкаУчета;
		ТекПрибор 								= Выборка.ПриборУчета;
		ТекШкала 								= Выборка.Шкала;
	КонецЦикла; 
	
	ТаблицаПоказанийДляЗаполнения 				= энргРаботаСПоказаниямиПриборовУчетаСервер.ТаблицаПоказаний(Объект.Организация,Объект.ТочкиУчета,Объект.ШкалыПриборовУчета,Объект.ПоказанияПриборовУчета,Объект.Район); 
	РезультатДанныеЗаполненияПоказаний 			= Обработки.энргПоказанияПриборовУчетаМенеджер.РезультатДанныеЗаполненияТаблицыПоказаний(Объект.Организация,Объект.Район,ТаблицаПоказанийДляЗаполнения,Объект.Дата);
	энргРаботаСПоказаниямиПриборовУчетаСервер.ЗаполнитьТабличнуюЧастьПоказанийПриборовУчета(РезультатДанныеЗаполненияПоказаний,ТаблицаПоказанийДляЗаполнения,Объект.ПоказанияПриборовУчета);
		
	энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(Объект, Объект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета); 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКлючПомещенияРодителя(КлючПомещения)
	Если НЕ ЗначениеЗаполнено(КлючПомещения.Помещение.Родитель) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	энргКлючиПомещений.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.энргКлючиПомещений КАК энргКлючиПомещений
	|ГДЕ
	|	энргКлючиПомещений.Строение = &Строение
	|	И энргКлючиПомещений.Помещение = &Помещение
	|	И НЕ энргКлючиПомещений.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Помещение", КлючПомещения.Помещение.Родитель);
	Запрос.УстановитьПараметр("Строение", КлючПомещения.Строение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаКлиенте
Процедура ОчиститьТЧ(Команда)
	Если Объект.ТочкиУчета.Количество() > 0 Тогда
		ДопПараметры	= Новый Структура;
		ДопПараметры.Вставить("ТекущийОбъект", 	Объект);
		ДопПараметры.Вставить("ТЧ_Объекта",		Новый Структура("ТочкиУчета, ПоказанияПриборовУчета, ШкалыПриборовУчета"));
		ПроверкаОчисткиТЧ(ДопПараметры);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОчисткиТЧ(ДопПараметры)
	ОписаниеОповещения  = Новый ОписаниеОповещения("ПроверкаОчисткиТЧЗавершение",ЭтотОбъект, ДопПараметры);
	ПоказатьВопрос(ОписаниеОповещения,"Очистить табличную часть?",РежимДиалогаВопрос.ДаНет);	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОчисткиТЧЗавершение(Результат,ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
			
		Если ДополнительныеПараметры.Свойство("ТЧ_Объекта") Тогда
			Для каждого ТекТЧ Из ДополнительныеПараметры.ТЧ_Объекта Цикл
				Объект[ТекТЧ.Ключ].Очистить();
			КонецЦикла;
		КонецЕсли;
		
		энргШкалыТарифныеЗоныСервер.ЗаполнитьПредставлениеФормы(ДополнительныеПараметры.ТекущийОбъект, ДополнительныеПараметры.ТекущийОбъект, ИспользоватьТарифныеЗоны, ИспользоватьШкалыПриборовУчета);

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
